#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_iam_role.labrole: Reading...
data.aws_eks_cluster.tc_eks_cluster: Reading...
data.aws_iam_role.labrole: Read complete after 0s [id=LabRole]
data.aws_eks_cluster.tc_eks_cluster: Read complete after 1s [id=eks_vid-proc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.process_service will be created
  + resource "helm_release" "process_service" {
      + atomic                     = false
      + chart                      = "../Helm/process_service-chart"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "process_service"
      + namespace                  = "dev"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                namespace: default
                
                # API
                apiName: process-service
                apiImage: 
                  name: brunapisera/process-service
                  tag: latest
                apiNodePort: 30200
                
                # Config map
                configmap:
                  name: process-service-config-map
                  data:
                
                rabbitmq:
                  username: xtpbliuz 
                  hostname: woodpecker-01.rmq.cloudamqp.com
                  password: 
                  port: 5672
                  virtualhost: xtpbliuz
                
                # Secret
                secret:
                  name: secret
                
                aws:
                  accessKeyId: 
                  secretAccessKey: 
                  sessionToken:
            EOT,
          + <<-EOT
                namespace: dev
                
                # API
                apiName: process-service
                apiImage: 
                  name: brunapisera/process-service
                  tag: latest
                apiNodePort: 30200
                
                # Secret
                secret:
                  name: secret
                
                rabbitmq:
                  username: xtpbliuz 
                  hostname: woodpecker-01.rmq.cloudamqp.com
                  password: 
                  port: 5672
                  virtualhost: xtpbliuz
                
                aws:
                  accessKeyId: 
                  secretAccessKey: 
                  sessionToken: 
                  bucketName: videouploadtc
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "aws.accessKeyId"
          + value = "ASIAZTYADNEJUSOA5STV"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "aws.secretAccessKey"
          + value = "zVTf0FQB0QQ26ZuJvVk72arV5szz36k1IJVMLtqt"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "aws.sessionToken"
          + value = "IQoJb3JpZ2luX2VjEMP//////////wEaCXVzLXdlc3QtMiJHMEUCIAj7sPx34LeCN/PquQ14zEKFwH2pLSxJ6DItDn/ai6i1AiEA/tNzvG2fLjp7wYzrBysoS5h7yr4E95cpsW5RlFaN1kcqtgIITBADGgw2NjA4ODgzMTYxNzkiDBPF8CMk5v37iAmYlyqTAuxZM7NYAKWpMsL9hOYoY2H8Deg2zmLarAhMOKJ8HB8y5yqDTimWrE3joeMT9cVBqNUW3+Sf89XpLmLM7Cq0PDOKqJ7pNP42jPBtzC1+ZDGuX0bzLCD1EAczzcQ6PX4bzmLSBSS2aW4yxeq4q15jw7818assXzCpuLNzawkC0bxgWSEKiRhgsZdFC40RDDISFhtA5JvNJAghLczTExMmxE4sA8oC5Y0esb53IGub69btNo5ZAajxBdiMljo0lLA3KAJ7wxY7die7wP3nbEuh6sHz6NxdMN+zAeKyw5XttO9gxCVk/Be80RlbwIDwPDQJgVzLFQp8ZYGc6JXyDSY70VbwBiaH1X+RMtSCpwTEfp8/ZLi+MLSCgMAGOp0BuuVE0LNfNOoxm2GpoGrU73DA2a/V7ZX6yux8WJDTkJGrukBtZHhbLzs+gWfdJAahTMdI5csW1fxpMUFco5DQQRQGGzdXkiIrwmwRzJk/bhkyXuLj5q8K9c/w0G49O9Ity7XwqtJgTirJ7h4Vw0cPBegkyfZZ4DwtzFmoM/+PwxFaR95/NrbPFjlpQTYe4CiWLjqYm5AG0QFumTwY3Q=="
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "rabbitmq.password"
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @AlexisCesar, Action: `pull_request`*